Revit 2027 API
ViewActivatingEventArgs Properties
The ViewActivatingEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
CurrentActiveView |  The view that is currently active.
Document |  The document associated with the event.
(Inherited from RevitAPIPreDocEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
NewActiveView |  The view that is going to become active.
Top
See Also
Reference
ViewActivatingEventArgs Class
Autodesk.Revit.UI.Events Namespace